performance-test.yml
config:
  target: https://octodocs.local
  phases:
    - duration: 60
      arrivalRate: 3
  # Load the Playwright engine:
  engines:
    playwright:
      {
        launchOptions: { headless: true },
        contextOptions: { ignoreHTTPSErrors: true },
      }
  # Path to JavaScript file that defines Playwright test functions
  # TypeScript is also supported
  processor: "./performance-test.ts"
  ignoreHTTPSErrors: true
scenarios:
  - engine: playwright
    testFunction: performanceTest